---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndAllNonZero
source: html/1abbb31d-1bff-4d17-6b1c-e67c2e5c6c6a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndAllNonZero Property

"All non 0 forces at end"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalMemberForceEndAllNonZero { get; }
```